#include <iostream>
#include <vector>
#include <string>

int main()
{
    // 체스판 크기
    int N = 8, M = 8;
    int N2 = 10, M2 = 13;

    vector<string> board;
    vector<string> board2;

    board =
    {
      {'W','B','W','B','W','B','W','B'},
      {'B','W','B','W','B','W','B','W'},
      {'W','B','W','B','W','B','W','B'},
      {'B','W','B','B','B','W','B','W'},
      {'W','B','W','B','W','B','W','B'},
      {'B','W','B','W','B','W','B','W'},
      {'W','B','W','B','W','B','W','B'},
      {'B','W','B','W','B','W','B','W'}
    };

    board2 =
    {
      {'B','B','B','B','B','B','B','B','W','B','W','B','W'},
      {'B','B','B','B','B','B','B','B','B','W','B','W','B'},
      {'B','B','B','B','B','B','B','B','W','B','W','B','W'},
      {'B','B','B','B','B','B','B','B','B','W','B','W','B'},
      {'B','B','B','B','B','B','B','B','W','B','W','B','W'},
      {'B','B','B','B','B','B','B','B','B','W','B','W','B'},
      {'B','B','B','B','B','B','B','B','W','B','W','B','W'},
      {'B','B','B','B','B','B','B','B','B','W','B','W','B'},
      {'W','W','W','W','W','W','W','W','W','W','B','W','B'},
      {'W','W','W','W','W','W','W','W','W','W','B','W','B'}
    };

    
    // 으ㅔㅇ??
    // 어떻게 하는겨

    for (int i = 0; i < board.size(); ++i)
    {

    }

}

/*
    1.서브 블록을 구할 때 주로 좌상단을 기준으로 구한다.
    2. (0.0) 대표 인덱스부터 순회한다.

    // ??? : N - 7 -> (-8 + 1)
    for(int i = 0; i < ???; ++i)
    {
        for(int j = 0; j < M - 7; ++j)
        {
            // 추출한 8 * 8 을 WBWB...패
        }
    }
    
*/